local m = {}
m['nativename'] = "ދިވެހި"
m[1] = {{term = "އަހަރެން‎"}, {term = "މަ", notes = "informal"}, {term = "އަޅުގަނޑު", notes = "formal"}}
m[2] = {{term = "ކަލޭ"}, {term = "ކަލާ‎"}}
m[3] = {{term = "އޭނާ‎", notes = "animate"}, {term = "އެ", notes = "inanimate"}, {term = "އެއާ‎", notes = "inanimate"}, {term = "އޭތި", notes = "inanimate"}}
m[4] = {{term = "އަހަރެމެން"}, {term = "އަލުގަނޑުމެން", notes = "formal"}}
m[5] = {{term = "ކަލޭމެން‎"}}
m[6] = {{term = "އެ މީހުން‎", notes = "animate"}, {term = "އެ ތަކެތި", notes = "inanimate"}}
m[7] = {{term =  "މި"}}
m[8] = {{term = "އެ"}}
m[9] = {{term =  "މިތާ"}}
m[10] = {{term = "އެތާ"}}
m[11] = {{term = "ކާކު"}}
m[12] = {{term = "ކޮންއެޗްޗެއް"},{term = "ކޯއްޗެއް"}}
m[13] = {{term = "ކޮންތާކު"}}
m[14] = {{term = "ކޮންއިރަކު"}}
m[15] = {{term = "ކިހިނެއް"}}
m[16] = {{term = "ނޫން"}}
m[17] = {{term = "ހުރިހާ"}}
m[18] = {{term = "ބައިވަރު"}}
m[19] = {{term = "ބައެއް"}}
m[20] = {{term = "މަދުން"}}
m[21] = {{term = "އަނެތް"}}
m[22] = {{term = "އެކެއް"}}
m[23] = {{term = "ދޭއް"}}
m[24] = {{term = "ތިނެއް"}}
m[25] = {{term = "ހަތަރެއް"}}
m[26] = {{term = "ފަހެއް"}}
m[27] = {{term = "ބޮޑު"}, {term = "ބޮނޑޮ"}, {term = "ބޮނޑަ"}}
m[28] = {{term = "ދިގު"}}
m[29] = {{term = "ފުޅާ"}}
m[30] = {{term = "ބޯ"}, {term = "އޮލަ", notes = "liquid"}}
m[31] = {{term = "ބަރު"}}
m[32] = {{term = "ކުޑަ"}}
m[33] = {{term = "ކުރު"}}
m[34] = {{term = "ހަނި"}}
m[35] = {{term = "ތުނި"}, {term = "ހިމަ"}}
m[36] = {{term = "އަންހެން މީހާ"}}
m[37] = {{term = "ފިރިހެން މީހާ"}}
m[38] = {{term = "މީހާ"}}
m[39] = {{term = "ކުއްޖާ"}}
m[40] = {{term = "އަނބި"}}
m[41] = {{term = "ފިރި"}, {term = "ފިރިމީހާ"}}
m[42] = {{term = "މަންމަ"}}
m[43] = {{term = "ބައްޕަ"}}
m[44] = {{term = "ޖަނަވާރު"}}
m[45] = {{term = "މަސް"}}
m[46] = {{term = "ދޫނި"}}
m[47] = {{term = "ބަޅު"}, {term = "ކުއްތާ"}}
m[48] = {{term = "އުކުނު"}, {term = "އުކުޱު"}}
m[49] = {{term = "ނަންނުގަތި"}, {term = "ހަރުފަ"}}
m[50] = {{term = "ފަނި"}, {term = "ފަޱި"}}
m[51] = {{term = "ގަސް"}}
m[52] = {{term = "ވަލު"}}
m[53] = {{term = "ދަނޑި"}}
m[54] = {{term = "މޭވާއެޅުން"}}
m[55] = {{term = "އޮށް"}}
m[56] = {{term = "ފަތް"}}
m[57] = {{term = "މޫ"}}
m[58] = {{term = "ތޮށި"}}
m[59] = {{term = "މާ"}}
m[60] = {{term = "ވިނަ"}}
m[61] = {{term = "ރޯނު"}, {term = "ރޯޱު"}}
m[62] = {{term = "ހަން"}}
m[63] = {{term = "މަސް"}}
m[64] = {{term = "ލޭ"}}
m[65] = {{term = "ކަށި"}}
m[66] = {{term = "ސަރުބީ"}}
m[67] = {{term = "ބިސް"}}
m[68] = {{term = "ދަޅު"}}
m[69] = {{term = "ނަގޫ"}}
m[70] = {{term = "ދޫނިފަތް"}}
m[71] = {{term = "އިސްތަށި"}}
m[72] = {{term = "ބޯ"}}
m[73] = {{term = "ކަންފަތް"}}
m[74] = {{term = "ލޯ"}}
m[75] = {{term = "ނޭފަތް"}}
m[76] = {{term = "އަނގަ"}}
m[77] = {{term = "ދަތް"}}
m[78] = {{term = "ދޫ"}}
m[79] = {{term = "ނިޔަފަތް"}}
m[80] = {{term = "ފައިތިލަ"}}
m[81] = {{term = "ފައި"}}
m[82] = {{term = "ކަކޫ"}}
m[83] = {{term = "އަތް"}}
m[84] = {{term = "ވަރަ"}, {term = "ފިޔަގަނޑު"}}
m[85] = {{term = "ބަނޑު"}}
m[86] = {{term = "ގޮހޮރު"}}
m[87] = {{term = "ކަރު"}}
m[88] = {{term = "ބުރަކަށި"}}
m[89] = {{term = "ކިސްފާ"}}
m[90] = {{term = "ހިތް"}}
m[91] = {{term = "މޭ"}}
m[92] = {{term = "ބުއިން"}}
m[93] = {{term = "ކެއުން"}}
m[94] = {{term = "ދައިގަތުން"}, {term = "ދަތްއެޅުން"}}
m[95] = {{term = "ބުއިން"}}
m[96] = {{term = "ކުޅުޖެހުން"}}
m[97] = {{term = "ހޮޑުލުން"}}
m[98] = {{term = "ފުމުން"}}
m[99] = {{term = "ނޭވާލުން"}}
m[100] = {{term = "ހުނުން"}}
m[101] = {{term = "ބެލުން"}}
m[102] = {{term = "އިވުން"}}
m[103] = {{term = "އެނގުން"}}
m[104] = {{term = "ވިސްނުން"}}
m[105] = {{term = "ވަސްބެލުން"}}
m[106] = {{term = "ބިރުގަތުން"}}
m[107] = {{term = "ނިދުން"}}
m[108] = {{term = "ދިރިހުރުން"}}
m[109] = {{term = "މަރުވުން"}}
m[110] = {{term = "މެރުން"}}
m[111] = {{term = "ތަޅާފޮޅުން"}}
m[112] = {{term = "ސިކާރަ (noun)"}}
m[113] = {{term = "ޖެހުން"}}
m[114] = {{term = "ކެފުން"}, {term = "ފޮތިކުރުން"}}
m[115] = {{term = "ބައިކުރުން"}, {term = "ފެޅުން"}}
m[116] = {{term = "ހެރުން"}}
m[117] = {{term = "ކެހުން"}}
m[118] = {{term = "ކޮންނުން"}, {term = "ކޮންޱުން"}}
m[119] = {{term = "ފެތުން"}}
m[120] = {{term = "އުދުހުން"}}
m[121] = {{term = "ހިނގުން"}}
m[122] = {{term = "އައުން"}}
m[123] = {{term = "އޮށޯޓުން"}}
m[124] = {{term = "އިށީނުން"}}
m[125] = {{term = "ކޮޅައްހުރުން"}}
m[126] = {{term = "އެނބުރުން"}}
m[127] = {{term = "ވެއްޓުން"}}
m[128] = {{term = "ދިނުން"}}
m[129] = {{term = "ހިފެހެއްޓުން"}}
m[130] = {{term = "ފިތުން"}}
m[131] = {{term = "އުންގުލްހުން"}}
m[132] = {{term = "ދޮވުން"}}
m[133] = {{term = "ފޮހުން"}}
m[134] = {{term = "ދެމުން"}}
m[135] = {{term = "ކޮއްޕުން"}}
m[136] = {{term = "އެއްލުން"}}
m[137] = {{term = "އެއްސުން"}}
m[138] = {{term = "ފެހުން"}}
m[139] = {{term = "ގުނުން"}}
m[140] = {{term = "ބުނުން"}}
m[141] = {{term = "ލަވަކިޔުން"}}
m[142] = {{term = "ކުޅުން"}}
m[143] = {{term = "އޮޔާދިއުން"}}
m[144] = {{term = "އޮއި ދެމުން"}}
m[145] = {{term = "ގަނޑުކުރުން"}}
m[146] = {{term = "ދުޅަވުން"}}
m[147] = {{term = "އިރު"}}
m[148] = {{term = "ހަނދު"}}
m[149] = {{term = "ތަރި"}}
m[150] = {{term = "ފެން"}}
m[151] = {{term = "ވާރޭ"}}
m[152] = {{term = "ކޯރު"}}
m[153] = {{term = "ކުޅި"}}
m[154] = {{term = "ކަނޑު"}}
m[155] = {{term = "ލޮނު"}, {term = "ލޮޱު"}}
m[156] = {{term = "ގާ"}}
m[157] = {{term = "ވެލި"}}
m[158] = {{term = "ހިރަފުސް"}}
m[159] = {{term = "ފަސް"}}
m[160] = {{term = "ވިލާ"}}
m[161] = {{term = "ބޯދުންފިނި"}}
m[162] = {{term = "އުޑު"}}
m[163] = {{term = "ވައި"}}
m[164] = {{term = "ސުނޯ"}}
m[165] = {{term = "ގަނޑުފެން"}}
m[166] = {{term = "ދުން"}}
m[167] = {{term = "އަލިފާން"}}
m[168] = {{term = "އަޅި"}}
m[169] = {{term = "އެނދުން"}}
m[170] = {{term = "މަގު"}}
m[171] = {{term = "ފަރުބަދަ"}}
m[172] = {{term = "ރަތް"}}
m[173] = {{term = "ފެހި"}}
m[174] = {{term = "ރީނދޫ"}}
m[175] = {{term = "ހުދު"}}
m[176] = {{term = "ކަޅު"}}
m[177] = {{term = "ރޭގަނޑު"}}
m[178] = {{term = "ދުވާލު"}, {term = "ދުވަސް"}}
m[179] = {{term = "އަހަރު"}}
m[180] = {{term = "ހޫނު"}, {term = "ހޫޱު"}}
m[181] = {{term = "ފިނި"}}
m[182] = {{term = "ފުރިފައި"}}
m[183] = {{term = "އާ"}, {term = "އައު"}}
m[180] = {{term = "ބާ"}, {term = "ބައު"}}
m[185] = {{term = "ރަނގަޅު"}}
m[186] = {{term = "ނުބައި"}, {term =  "ގޯސް"}}
m[187] = {{term = "ފީ"}}
m[188] = {{term = "ހަޑި"}}
m[189] = {{term = "ސީދާ"}}
m[190] = {{term = "ވަށް"}}
m[191] = {{term = "ތޫނު"}}
m[192] = {{term = "ކޮށި"}}
m[193] = {{term = "އޮމާން"}}
m[194] = {{term = "ތެތް"}}
m[195] = {{term = "ހިކި"}, {term =  "ދަހަނގު"}}
m[196] = {{term = "ރަނގަޅު"}}
m[197] = {{term = "ކައިރި"}}
m[198] = {{term = "ދުރު"}}
m[199] = {{term = "ކަނާތު"}}
m[200] = {{term = "ވާއަތު"}}
m[201] = {{term = "ގައި-", notes = "locative"}}
m[202] = {{term = "ތެރޭގައި"}}
m[203] = {{term = "އެކުގަ"}}
m[204] = {{term = "އާއި"}, {term = "އަދި"}}
m[205] = {{term = "ނަމަ-"}}
m[206] = {{term = "އެހެންވެ"}}
m[207] = {{term = "ނަން"}}
return m
