local m = {}

m['nativename'] = "الْعَرَبِيَّة"
m[1] = {{term = "أَنَا"}}
m[2] = {
    {term = "أَنْتَ<notes:masculine>"},
    {term = "أَنْتِ<notes:feminine>"}
}
m[3] = {
    {term = "هُوَ<notes:masculine>"},
    {term = "هِيَ<notes:feminine>"},
}
m[4] = {{term = "نَحْنُ"}}
m[5] = {
    {
        term = "أَنْتُمْ",
        notes = "masculine, plural",
    }, {
        term = "أَنْتُنَّ",
        notes = "feminine, plural",
    }, {term = "أَنْتُمَا<notes:dual>"}
}
m[6] = {
    {term = "هُمْ<notes:masculine, plural>"},
    {term = "هُنَّ<notes:feminine, plural>"},
    {term = "هُمَا<notes:dual>"},
}
m[7] = {
    {term = "هٰذَا<notes:masculine sentient>"},
    {
        term = "هٰذِهِ",
        notes = "feminine, non-sentient",
    },
    {
        term = "هٰذِي",
        notes = "feminine, non-sentient",
    }
}
m[8] = {
    {term = "ذٰلِكَ"},
    {term = "ذَاكَ"},
    {term = "تِلْكَ"},
    {term = "تِيكَ"},
}
m[9] = {{term = "هُنَا"}}
m[10] = {
    {term = "هُنَاكَ"},
    {term = "هُنَالِكَ"},
    {term = "ثَمَّ"},
}
m[11] = {{term = "مَنْ"}}
m[12] = {
    {term = "مَا"},
    {term = "مَاذَا"},
}
m[13] = {{term = "أَيْن"}}
m[14] = {{term = "مَتَى"}}
m[15] = {{term = "كَيْف"}}
m[16] = {
    {term = "لَا"}, {term = "مَا"},
    {term = "لَنْ<notes:future>"},
    {term = "لَمْ<notes:past>"},
}
m[17] = {{term = "كُلّ"}}
m[18] = {{term = "كَثِير"}}
m[19] = {{term = "بَعْض"}}
m[20] = {{term = "قَلِيل"}}
m[21] = {
    {term = "آخَر"},
}
m[22] = {
    {term = "وَاحِد"},
}
m[23] = {
    {term = "اِثْنَان"},
}
m[24] = {
    {term = "ثَلَاثَة"},
}
m[25] = {
    {term = "أَرْبَعَة"},
}
m[26] = {
    {term = "خَمْسَة"},
}
m[27] = {{term = "كَبِير"}}
m[28] = {{term = "طَوِيل"}}
m[29] = {
    {term = "رَحْب"},
    {term = "وَاسِع"},
}
m[30] = {{term = "سَمِيك"}}
m[31] = {{term = "ثَقِيل"}}
m[32] = {{term = "صَغِير"}}
m[33] = {{term = "قَصِير"}}
m[34] = {{term = "ضَيِّق"}}
m[35] = {{term = "رَقِيق"}}
m[36] = {
    {term = "اِمْرَأَة"},
}
m[37] = {{term = "رَجُل"}}
m[38] = {{term = "إِنْسَان"}}
m[39] = {{term = "طِفْل"}}
m[40] = {{term = "زَوْجَة"}}
m[41] = {
    {term = "زَوْج"},
    {term = "بَعْل"},
}
m[42] = {{term = "أُمّ"}}
m[43] = {{term = "أَب"}}
m[44] = {{term = "حَيَوَان"}}
m[45] = {
    {term = "سَمَك"},
    {term = "حُوت"}
}
m[46] = {
    {term = "طَائِر"},
    {term = "عُصْفُور"}
}
m[47] = {{term = "كَلْب"}}
m[48] = {{term = "قَمْل"}}
m[49] = {
    {term = "حَنَش"},
    {term = "ثُعْبَان"},
    {term = "حَيَّة"},
    {term = "أَفْعًى"}
}
m[50] = {{term = "دُود"}}
m[51] = {{term = "شَجَرَة"}}
m[52] = {{term = "غَابَة"}}
m[53] = {{term = "عَصًا"}}
m[54] = {{term = "فَاكِهَة"}}
m[55] = {
    {term = "زَرْع"},
    {term = "زَرِّيعَة"}
}
m[56] = {{term = "وَرَقَة"}}
m[57] = {
    {term = "جِذْر"},
    {term = "جَذْر"},
}
m[58] = {{term = "قِلْف"}}
m[59] = {{term = "زَهْرَة"}}
m[60] = {{term = "حَشِيش"}}
m[61] = {{term = "حَبْل"}}
m[62] = {{term = "جِلْد"}}
m[63] = {{term = "لَحْم"}}
m[64] = {{term = "دَم"}}
m[65] = {{term = "عَظْم"}}
m[66] = {{term = "دُهْن"}}
m[67] = {{term = "بَيْضَة"}}
m[68] = {{term = "قَرْن"}}
m[69] = {{term = "ذَنَب"}}
m[70] = {{term = "رِيشَة"}}
m[71] = {
    {term = "شَعْر"},
}
m[72] = {{term = "رَأْس"}}
m[73] = {
    {term = "أُذُن"},
}
m[74] = {{term = "عَيْن"}}
m[75] = {{term = "أَنْف"}}
m[76] = {{term = "فَم"}}
m[77] = {{term = "سِنّ"}}
m[78] = {{term = "لِسَان"}}
m[79] = {{term = "ظُفْر"}}
m[80] = {{term = "قَدَم"}}
m[81] = {{term = "رِجْل"}}
m[82] = {{term = "رُكْبَة"}}
m[83] = {{term = "يَد"}}
m[84] = {
    {term = "كَنَف"},
    {term = "جَنَاح"}
}
m[85] = {{term = "بَطْن"}}
m[86] = {{term = "أَمْعَاء"}}
m[87] = {{term = "رَقَبَة"}}
m[88] = {{term = "ظَهْر"}}
m[89] = {
	{term = "ثَدْي"},
	{term = "صَدْر"}
}
m[90] = {
    {term = "لُبّ"}, {term = "قَلْب"}
}
m[91] = {{term = "كَبِد"}}
m[92] = {{term = "شَرِبَ"}}
m[93] = {{term = "أَكَلَ"}}
m[94] = {{term = "عَضَّ"}}
m[95] = {{term = "مَصَّ"}}
m[96] = {{term = "بَصَقَ"}}
m[97] = {{term = "تَقَيَّأَ"}}
m[98] = {{term = "نَفَخَ"}}
m[99] = {{term = "تَنَفَّسَ"}}
m[100] = {{term = "ضَحِكَ"}}
m[101] = {{term = "رَأَى"}}
m[102] = {{term = "سَمِعَ"}}
m[103] = {{term = "عَرَفَ"}}
m[104] = {{term = "فَكَرَ"}}
m[105] = {{term = "شَمَّ"}}
m[106] = {{term = "خَافَ"}}
m[107] = {{term = "نَامَ"}}
m[108] = {{term = "عَاشَ"}}
m[109] = {{term = "مَاتَ"}}
m[110] = {{term = "قَتَلَ"}}
m[111] = {{term = "قَاتَلَ"}}
m[112] = {{term = "صَادَ"}}
m[113] = {{term = "ضَرَبَ"}}
m[114] = {{term = "قَطَعَ"}}
m[115] = {{term = "شَقَّ"}}
m[116] = {{term = "طَعَنَ"}}
m[117] = {{term = "خَدَشَ"}}
m[118] = {{term = "حَفَرَ"}}
m[119] = {
    {term = "سَبَحَ"},
    {term = "عَامَ"},
}
m[120] = {{term = "طَارَ"}}
m[121] = {{term = "مَشَى"}}
m[122] = {
    {term = "جَاءَ"},
    {term = "بَاءَ"},
    {term = "أَتَى"},
}
m[123] = {{term = "رَقَدَ"}}
m[124] = {{term = "جَلَسَ"}}
m[125] = {{term = "وَقَفَ"}}
m[126] = {{term = "دَارَ"}}
m[127] = {
    {term = "وَقَعَ"},
    {term = "سَقَطَ"},
    {term = "طَاحَ"}
}
m[128] = {{term = "أَعْطَى"}}
m[129] = {{term = "أَخَذَ"}}
m[130] = {{term = "عَصَرَ"}}
m[131] = {{term = "حَكَّ"}}
m[132] = {{term = "غَسَلَ"}}
m[133] = {
    {term = "مَحَا"},
    {term = "مَسَحَ"}
}
m[134] = {{term = "جَرَّ"}}
m[135] = {{term = "دَفَعَ"}}
m[136] = {{term = "رَمَى"}}
m[137] = {{term = "رَبَطَ"}}
m[138] = {
    {term = "خَاطَ"},
    {term = "خَيَّطَ"}
}
m[139] = {{term = "عَدَّ"}}
m[140] = {{term = "قَالَ"}}
m[141] = {{term = "غَنَّى"}}
m[142] = {{term = "لَعِبَ"}}
m[143] = {
    {term = "عَامَ"},
    {term = "طَفَا"}
}
m[144] = {{term = "تَدَفَّقَ"}}
m[145] = {{term = "جَمَدَ"}}
m[146] = {
    {term = "وَرِمَ"},
    {term = "اِنْتَفَخَ"}
}
m[147] = {{term = "شَمْس"}}
m[148] = {{term = "قَمَر"}}
m[149] = {
    {term = "نَجْم"},
    {term = "كَوْكَب"}
}
m[150] = {{term = "مَاء"}}
m[151] = {{term = "مَطَر"}}
m[152] = {
    {term = "نَهْر"},
    {term = "نَهَر"}
}
m[153] = {{term = "بُحَيْرَة"}}
m[154] = {
    {term = "بَحْر"}, {term = "يَمّ"}
}
m[155] = {{term = "مِلْح"}}
m[156] = {{term = "حَجَر"}}
m[157] = {{term = "رَمْل"}}
m[158] = {{term = "غُبَار"}}
m[159] = {{term = "أَرْض"}}
m[160] = {
    {term = "سَحَابَة"},
    {term = "غَيْمَة"},
    {term = "غَمَامَة"},
    {term = "عَنَانَة"}
}
m[161] = {{term = "ضَبَاب"}}
m[162] = {{term = "سَمَاء"}}
m[163] = {{term = "رِيح"}}
m[164] = {{term = "ثَلْج"}}
m[165] = {{term = "جَلِيد"}}
m[166] = {
    {term = "دُخَان"},
    {term = "دُخَّان"}
}
m[167] = {{term = "نَارَ"}}
m[168] = {{term = "رَمَاد"}}
m[169] = {{term = "حَرَقَ"}}
m[170] = {{term = "طَرِيق"}}
m[171] = {{term = "جَبَل"}}
m[172] = {
    {term = "أَحْمَر"}
}
m[173] = {
    {term = "أَخْضَر"}
}
m[174] = {
    {term = "أَصْفَر"}
}
m[175] = {
    {term = "أَبْيَض"}
}
m[176] = {
    {term = "أَسْوَد"}
}
m[177] = {{term = "لَيْل"}}
m[178] = {{term = "يَوْم"}}
m[179] = {
    {term = "سَنَة"},
    {term = "عَام"}
}
m[180] = {{term = "دَافِئ"}}
m[181] = {{term = "بَارِد"}}
m[182] = {{term = "مُمْتَلِئ"}}
m[183] = {
    {term = "جَدِيد"},
    {term = "حَدِيث"}
}
m[184] = {
    {term = "قَدِيم"},
    {term = "عَتِيق"}
}
m[185] = {{term = "طَيِّب"}}
m[186] = {{term = "سَيِّئ"}}
m[187] = {{term = "مُتَعَفِّن"}}
m[188] = {
    {term = "قَذِر"},
    {term = "وَسِخ"}
}
m[189] = {{term = "مُسْتَقِيم"}}
m[190] = {{term = "مُسْتَدِير"}}
m[191] = {{term = "حَادّ"}}
m[192] = {
    {term = "ثَلِم"},
    {term = "كَلِيل"}
}
m[193] = {{term = "نَاعِم"}}
m[194] = {{term = "رَطْب"}}
m[195] = {
    {term = "جَافّ"},
    {term = "يَابِس"}
}
m[196] = {{term = "صَحِيح"}}
m[197] = {{term = "قَرِيب"}}
m[198] = {{term = "بَعِيد"}}
m[199] = {{term = "يَمِين"}}
m[200] = {
    {term = "شِمَال"},
    {term = "يَسَار"}
}
m[201] = {{term = "عِنْدَ"}}
m[202] = {{term = "فِي"}, {term = "بِ"}}
m[203] = {{term = "مَعَ"}, {term = "بِ"}}
m[204] = {{term = "وَ"}}
m[205] = {
    {term = "لَوْ"},
    {term = "إِذَا"},
    {term = "إِنْ"}
}
m[206] = {
    {term = "لِأَنَّ"},
    {term = "بِسَبَبِ"},
    {term = "حَيْثُ"}
}
m[207] = {{term = "اِسْم"}}

local ar_IPA = require('Module:ar-pronunciation')

m.ipa_generator = function(ipa_respelling, term)
	local base_term = ipa_respelling or term
	return "/" .. ar_IPA.toIPA({ term = base_term }) .. "/"
end

return m
