local m = {}
m['nativename'] = "മലയാളം"
m[1] = {{term = "ഞാൻ"}}
m[2] = {{term = "നീ", notes = "impolite"}, {term = "Thesaurus:നീ"}}
m[3] = {{term = "അവൻ", notes = "impolite"}, {term = "അവൾ", notes = "impolite"}, {term = "അത്"}, {term = "അദ്ദേഹം",  notes = "respectful", notes = "Replace initial a/അ with i/ഇ to get proximal version"}}
m[4] = {{term = "നമ്മൾ"}, {term = "ഞങ്ങൾ"}}
m[5] = {{term = "നിങ്ങൾ"}}
m[6] = {{term = "അവർ", notes = "Replace initial a/അ with i/ഇ to get proximal version"}}
m[7] = {{term = "ഇത്"}}
m[8] = {{term = "അത്"}}
m[9] = {{term = "ഇവിടെ"}}
m[10] = {{term = "അവിടെ"}}
m[11] = {{term = "ആര്"}}
m[12] = {{term = "എന്ത്"}}
m[13] = {{term = "എവിടെ"}}
m[14] = {{term = "എപ്പോൾ"}}
m[15] = {{term = "എങ്ങനെ"}}
m[16] = {{term = "അല്ല"},  {term ="ഇല്ല"}}
m[17] = {{term = "എല്ലാം"}, {term = "സർവ്വ"}, {term = "മുഴുവൻ"}, {term ="മൊത്തം"}}
m[18] = {{term = "കുറേ"}, {term = "പല"}}
m[19] = {{term = "ചില"}, {term = "ചിലത്"}}
m[20] = {{term = "കുറച്ച്"}, {term = "അൽപം"}}
m[21] = {{term = "വേറെ"}, {term = "മറ്റ്"}}
m[22] = {{term = "ഒന്ന്"}}
m[23] = {{term = "രണ്ട്"}}
m[24] = {{term = "മൂന്ന്"}}
m[25] = {{term = "നാല്"}, {term = "നാങ്ക്"}}
m[26] = {{term = "അഞ്ച്"}}
m[27] = {{term = "വലിയ"}}
m[28] = {{term = "നീളമുള്ള"}}
m[29] = {{term = "വീതിയുള്ള"}}
m[30] = {{term = "കട്ടിയുള്ള"}}
m[31] = {{term = "കനത്ത"}, {term = "ഭാരമുള്ള"}}
m[32] = {{term = "ചെറിയ"}}
m[33] = {{term = "കുറിയ"}}
m[34] = {{term = "ഇടുങ്ങിയ"}}
m[35] = {{term = "മെലിഞ്ഞ"}}
m[36] = {{term = "സ്ത്രീ"}, {term = "പെണ്ണ്"}}
m[37] = {{term = "പുരുഷൻ"}, {term = "ആണ്"}}
m[38] = {{term = "Thesaurus:മനുഷ്യൻ"}}
m[39] = {{term = "കുട്ടി"}, {term = "കുഞ്ഞ്"}, {term = "ശിശു"}, {term = "പിള്ള"}, {term = "കിടാവ്"}}
m[40] = {{term = "ഭാര്യ"}, {term = "കെട്ടിയവൾ"}}
m[41] = {{term = "ഭർത്താവ്"},{term = "കെട്ടിയവൻ"}}
m[42] = {{term = "Thesaurus:അമ്മ"}}
m[43] = {{term = "Thesaurus:അച്ഛൻ"}}
m[44] = {{term = "മൃഗം"}, {term = "ജന്തു"}, {term = "ജീവി"}}
m[45] = {{term = "മീൻ"}, {term = "മത്സ്യം"}, {term = "ഝഷം"}, {term = "കന്നൽ"}}
m[46] = {{term = "കിളി"}, {term = "പക്ഷി"}}
m[47] = {{term = "പട്ടി"}, {term = "നായ"}, {term = "ശ്വാനൻ"}}
m[48] = {{term = "പേൻ"}}
m[49] = {{term = "പാമ്പ്"}, {term = "സർപ്പം"}}
m[50] = {{term = "പുഴു"}, {term = "കൃമി"}}
m[51] = {{term = "മരം"}, {term = "വൃക്ഷം"}}
m[52] = {{term = "കാട്"}, {term = "വനം"}, {term = "കാനനം"}}
m[53] = {{term = "വടി"}, {term = "കമ്പ്"}}
m[54] = {{term = "പഴം"}, {term = "ഫലം"}}
m[55] = {{term = "വിത്ത്"}, {term = "കുരു"}}
m[56] = {{term = "ഇല"}}
m[57] = {{term = "വേര്"}}
m[58] = {{term = "തോൽ"}, {term = "മരത്തോൽ"}}
m[59] = {{term = "പൂവ്"}, {term = "പൂ"}, {term = "പുഷ്പം"}}
m[60] = {{term = "പുല്ല്"}}
m[61] = {{term = "കയർ"}}
m[62] = {{term = "തൊലി"}}
m[63] = {{term = "മാംസം"}, {term = "ഇറച്ചി"}}
m[64] = {{term = "ചോര"}, {term = "രക്തം"}, {term ="കുരുതി"}, {term ="നിണം "}}
m[65] = {{term = "എല്ല്"}, {term = "അസ്ഥി"}}
m[66] = {{term = "കൊഴുപ്പ്"}}
m[67] = {{term = "മുട്ട"}}
m[68] = {{term = "കൊമ്പ്"}}
m[69] = {{term = "വാൽ"}}
m[70] = {{term = "തൂവൽ"}}
m[71] = {{term = "മുടി"}, {term= "കൂന്തൽ"}, {term ="മയിർ"}}
m[72] = {{term = "തല"}}
m[73] = {{term = "ചെവി"}, {term = "കാത്"}}
m[74] = {{term = "Thesaurus:കണ്ണ്"}}
m[75] = {{term = "മൂക്ക്"}}
m[76] = {{term = "വായ"}}
m[77] = {{term = "പല്ല്"}}
m[78] = {{term = "നാക്ക്"}, {term = "നാവ്"}}
m[79] = {{term = "നഖം"}}
m[80] = {{term = "പാദം"}, {term = "കാലടി"}}
m[81] = {{term = "കാല്"}}
m[82] = {{term = "മുട്ട്"}}
m[83] = {{term = "കൈ"}, {term = "കരം"}, {term = "ഹസ്തം"}}
m[84] = {{term = "ചിറക്"}}
m[85] = {{term = "വയറ്"}}
m[86] = {{term = "കുടൽ"}}
m[87] = {{term = "കഴുത്ത്"}}
m[88] = {{term = "മുതുക്"}, {term ="പുറം"}}
m[89] = {{term = "മുല"}, {term = "സ്തനം"}}
m[90] = {{term = "ഹൃദയം"}, {term ="നെഞ്ചകം"}}
m[91] = {{term = "കരൾ"}}
m[92] = {{term = "കുടിക്കുക"}}
m[93] = {{term = "കഴിക്കുക"}, {term = "തിന്നുക"}, {term = "ഉണ്ണുക"}, {term = "ഭക്ഷിക്കുക"}}
m[94] = {{term = "കടിക്കുക"}}
m[95] = {{term = "ചപ്പുക"}}
m[96] = {{term = "തുപ്പുക"}}
m[97] = {{term = "ഛർദ്ദിക്കുക"}}
m[98] = {{term = "ഊതുക"}}
m[99] = {{term = "ശ്വസിക്കുക"}}
m[100] = {{term = "ചിരിക്കുക"}}
m[101] = {{term = "കാണുക"}}
m[102] = {{term = "കേൾക്കുക"}}
m[103] = {{term = "അറിയുക"}}
m[104] = {{term = "ചിന്തിക്കുക"}, {term = "ഓർക്കുക"}, {term = "വിചാരിക്കുക"}, {term ="ആലോചിക്കുക"}}
m[105] = {{term = "മണക്കുക"}}
m[106] = {{term = "പേടിക്കുക"}}
m[107] = {{term = "ഉറങ്ങുക"}}
m[108] = {{term = "ജീവിക്കുക"},{term = "വാഴുക"}, {term = "പൊറുക്കുക"}}
m[109] = {{term = "Thesaurus:മരിക്കുക"}}
m[110] = {{term = "കൊല്ലുക"}}
m[111] = {{term = "പോരാടുക"}, {term ="പൊരുതുക"}}
m[112] = {{term = "വേട്ടയാടുക"}, {term = "നായാടുക"}}
m[113] = {{term = "ഇടിക്കുക"}}
m[114] = {{term = "മുറിക്കുക"}}
m[115] = {{term = "പിളർക്കുക"}, {term = "വിഭജിക്കുക"}}
m[116] = {{term = "കുത്തുക"}}
m[117] = {{term = "മാന്തുക"}}
m[118] = {{term = "കുഴിക്കുക"}}
m[119] = {{term = "നീന്തുക"}}
m[120] = {{term = "പറക്കുക"}}
m[121] = {{term = "നടക്കുക"}}
m[122] = {{term = "വരുക"}}
m[123] = {{term = "കിടക്കുക"}}
m[124] = {{term = "ഇരിക്കുക"}}
m[125] = {{term = "നിൽക്കുക"}}
m[126] = {{term = "തിരിയുക"}}
m[127] = {{term = "വീഴുക"}}
m[128] = {{term = "നൽകുക"}, {term = "തരുക", notes = "only for 1st or 2nd"}, {term = "കൊടുക്കുക", notes = "only for 3rd person"}}
m[129] = {{term = "പിടിക്കുക"}}
m[130] = {{term = "പിഴിയുക"}, {term = "ഞെക്കുക"}}
m[131] = {{term = "ഉരയ്ക്കുക"}}
m[132] = {{term = "കഴുകുക"}, {term = "അലക്കുക"}}
m[133] = {{term = "തുടയ്ക്കുക"}}
m[134] = {{term = "വലിക്കുക"}}
m[135] = {{term = "തള്ളുക"}, {term = "ഉന്തുക"}}
m[136] = {{term = "എറിയുക"}}
m[137] = {{term = "കെട്ടുക"}}
m[138] = {{term = "തയ്ക്കുക"}}
m[139] = {{term = "എണ്ണുക"}}
m[140] = {{term = "പറയുക"}}
m[141] = {{term = "പാടുക"}}
m[142] = {{term = "കളിക്കുക"}}
m[143] = {{term = "പൊങ്ങുക"}}
m[144] = {{term = "ഒഴുകുക"}}
m[145] = {{term = "തണുത്ത് ഉറയുക"}}
m[146] = {{term = "വീർക്കുക"}}
m[147] = {{term = "Thesaurus:സൂര്യൻ"}}
m[148] = {{term = "Thesaurus:ചന്ദ്രൻ"}}
m[149] = {{term = "നക്ഷത്രം"}, {term = "താരം"}, {term="മീൻ"}}
m[150] = {{term = "Thesaurus:വെള്ളം"}}
m[151] = {{term = "മഴ"}, {term = "വർഷം"}, {term ="മാരി"}}
m[152] = {{term = "പുഴ"}, {term = "ആറ്"}, {term = "നദി"}}
m[153] = {{term = "തടാകം"}, {term = "കുളം"}}
m[154] = {{term = "കടൽ"}, {term = "സമുദ്രം"}}
m[155] = {{term = "ഉപ്പ്"}}
m[156] = {{term = "കല്ല്"}}
m[157] = {{term = "മണൽ"}, {term = "മണ്ണ്"}}
m[158] = {{term = "പൊടി"}}
m[159] = {{term = "Thesaurus:ഭൂമി"}}
m[160] = {{term = "മേഘം"}, {term ="മുകിൽ"}, {term= "കൊണ്ടൽ"}}
m[161] = {{term = "മൂടൽമഞ്ഞ്"}}
m[162] = {{term = "ആകാശം"}, {term = "വാനം"}, {term = "മാനം"}, {term = "വിണ്ണ്"}, {term = "വിണ്ടലം"}}
m[163] = {{term = "കാറ്റ്"}}
m[164] = {{term = "മഞ്ഞ്"}}
m[165] = {{term = "ഐസ്"}, {term = "മഞ്ഞുകട്ട"}}
m[166] = {{term = "പുക"}}
m[167] = {{term = "Thesaurus:തീ"}}
m[168] = {{term = "ചാരം"}, {term = "ചാമ്പൽ"}}
m[169] = {{term = "കത്തിക്കുക"}}
m[170] = {{term = "റോഡ്"}, {term = "വഴി"}, {term = "പാത"}}
m[171] = {{term = "മല"}, {term = "പർവ്വതം"}}
m[172] = {{term = "Thesaurus:ചുവപ്പ്"}}
m[173] = {{term = "പച്ച"}}
m[174] = {{term = "മഞ്ഞ"}}
m[175] = {{term = "വെള്ള"}}
m[176] = {{term = "കറുപ്പ്"}}
m[177] = {{term = "രാത്രി"}, {term ="രാവ്"}}
m[178] = {{term = "ദിവസം"}, {term ="ദിനം"}, {term ="നാൾ "}, {term ="പകൽ "}}
m[179] = {{term = "വർഷം"}, {term = "കൊല്ലം"}, {term = "ആണ്ട്"}}
m[180] = {{term = "ചൂട്"}}
m[181] = {{term = "തണുപ്പ്"}}
m[182] = {{term = "നിറഞ്ഞ"}}
m[183] = {{term = "പുതിയ"}}
m[184] = {{term = "പഴയ"}}
m[185] = {{term = "നല്ല"}}
m[186] = {{term = "മോശം"}, {term = "ചീത്ത"}}
m[187] = {{term = "അഴുകിയ"}, {term = "ചീഞ്ഞ"}, {term = "അളിഞ്ഞ"}}
m[188] = {{term = "അഴുക്കായ"}}
m[189] = {{term = "നേരെ"}}
m[190] = {{term = "വട്ടം"}}
m[191] = {{term = "മൂർച്ചയുള്ള"}}
m[192] = {{term = "മൂർച്ച കുറഞ്ഞ"}}
m[193] = {{term = "മിനുസമാർന്ന"}}
m[194] = {{term = "നനഞ്ഞ"},{term ="ഈറൻ"}}
m[195] = {{term = "വരണ്ട"}, {term = "ഉണങ്ങിയ"}}
m[196] = {{term = "ശരി"}}
m[197] = {{term = "അടുത്ത്"},{term = "അരികിൽ"},{term = "സമീപം"}}
m[198] = {{term = "അകലെ"}, {term = "ദൂരെ"}}
m[199] = {{term = "വലത്"}}
m[200] = {{term = "ഇടത്"}}
m[201] = {{term = "-ഇൽ"}}
m[202] = {{term = "-ഇൽ"}}
m[203] = {{term = "കൂടെ"}, {term = "ഒപ്പം"}}
m[204] = {{term = "-ഉം"}, {term = "കൂടെ"}}
m[205] = {{term = "-എങ്കിൽ"}}
m[206] = {{term = "കാരണം"},{ term = "എന്തെന്നാൽ "}, {term ="എന്തുകൊണ്ടെന്നാൽ"}}
m[207] = {{term = "പേര് "}, {term = "നാമം"}}
return m
